[{"url":"090663d3-9597-49e7-879d-55d1072606f9","created":1638135522463,"order":4,"markdown":"Veja se você já consegue adaptar o seu currículo direitinho.","title":"Teste seu conhecimento","questions":[{"question":"Um exemplo ruim seria:","explanation":"Lembre-se de que devemos começar com uma ação na primeira pessoa do singular.","items":["Participei de uma equipe responsável pelo backend de transações bancárias.","Eu era responsável pelo backend de transações bancárias.","Eu fazia rotinas de manutenção no banco de dados.","Criava relatórios baseados em dados históricos de acesso.",""]},{"explanation":"O contexto deve vir depois da descrição de suas atividades. Contexto irrelevante fica de fora.","items":["Eu fazia manutenção de sistemas Java em um time grande com muitas responsabilidades.","O time era grande e havia muitas responsabilidades, mas eu fazia manutenção de sistemas Java.","O chefe era chato, mas eu fazia bem a manutenção de sistemas Java.","Eu fazia bem a manutenção de sistemas Java, mesmo o chefe sendo chato.",""],"question":"Um exemplo bom seria:"}],"modified":1638371948716,"type":"quiz"},{"created":1638135313166,"type":"text","markdown":"Segue a mesma lógica adotada em português:\n\n* I was responsible for...\n* I Implanted...\n* In charge of doing...\n* In charge of monitoring...","title":"Exemplos em inglês","url":"4678b195-61f4-4145-8096-eae22cb21394","order":3,"modified":1638372060198},{"title":"Entenda como deixar claro o seu papel","modified":1638134966327,"created":1638134966327,"markdown":null,"order":1,"type":"youtube","url":"85dce272-561a-4797-a619-ecca5254516e","videoId":"fB_gVRQlaTo","moreMarkdown":null},{"type":"text","modified":1639920723750,"url":"bf65a58d-10e3-40be-a2e7-18618d2b31e7","created":1638135234218,"title":"Eu e não Nós","markdown":"Devemos usar o pronome **eu** sempre que possível. O verbo, porém, deve estar conjugado como se fosse ***eu*** falando.\n\n***Desenvolva as descrições de experiências profissionais sempre começando com uma ação conjugada na primeira pessoa do singular.***\n\nAlguns exemplos:\n\n* Eu fui responsável por...\n* Eu era encarregado de...\n* Desenvolvi a solução...\n* Implantei a técnica...\n\n***O uso do pronome na primeira pessoa do singular pode parecer pedante, mas, aqui, o entrevistador:***\n\n* quer saber o que você fez e não o que sua equipe fez;\n* seu papel na equipe e não informações sobre a equipe ou algum membro dela.","order":2}]