[{"title":"Experiências profissionais","created":1638139111623,"modified":1638363903592,"url":"1226d8f5-a2e3-4c23-b071-d60da98b8492","type":"youtube","markdown":"***Nem toda experiência profissional deve estar no seu currículo.***\n\n* As que devem lá estar são as que têm alguma coisa a ver com sua carreira em TI.\n\n***Ter sido motorista, garçom ou ter trabalhado em um shopping, por exemplo, é relevante para você, sua história, sua determinação, mas, na gringa, o que importa realmente:***\n\n* é aquilo que tem a ver com a vaga que você pleiteia;\n* é a relação do que você fez com sua formação em TI;\n* é em que o que você fez definiu suas experiências e te capacita para assumir a vaga pretendida.","order":3,"moreMarkdown":null,"videoId":"9FiTc50e7z4"},{"videoId":"zN3-yZSkIDo","order":1,"url":"130083bd-a6f9-4d6e-a308-923d2a4aef90","markdown":"***Ficam dentro:***\n\n* seu número de telefone;\n* seu endereço de e-mail:\n* seu Linkdin (no máximo). \n\n***Ficam fora:***\n\n* seu Instagram;\n* seu Facebook;\n* sua orientação sexual;\n* sua altura;\n* seu peso;\n* cor de seu cabelo:\n* cor de seus olhos;\n* de que animal gosta (cachorro, gato, papagaio, periquito...);\n* comida preferida;\n* seu estado civil.\n\n***Sobre o estado civil:***\n\n* Nos EUA, é crime o entrevistador perguntar o estado civil do candidato. Em uma entrevista, você pode dar esta \n   informação, mas não como resposta a uma pergunta feita a você.\n* Não pense que a lógica de que a pessoa casada é mais responsável ou mais preparada para alguns cargos \n   funciona, pois não funciona.","type":"youtube","modified":1638272524621,"moreMarkdown":"","title":"Informações pessoais","created":1638138967989},{"created":1638139050264,"url":"caf85180-c23a-42ba-8f88-e47a3f740a0e","modified":1638313194481,"type":"youtube","order":2,"videoId":"liTawr5nGWQ","moreMarkdown":null,"title":"Habilidades \"extraordinárias\"","markdown":"***Dizer que é músico(a), lutador(a) (de judô, jiu jitsu, capoeira, MMA etc.) ou cozinheiro(a) ajuda a conquistar uma \n     vaga?***\n\n* Tais informações ficam fora do currículo, visto que essas habilidades não têm relação direta com TI.\n\n***Ter uma dessas habilidades informa que a pessoa é criativa e versátil?*** \n\n* Sim, mas nos EUA, no Canadá, nos países da Europa e na Austrália, não rola.\n* Para ocupar a vaga, essas informações atrapalham. Tendo ocupado a vaga, essas habilidades serão conhecidas \n   dos colegas de trabalho ao longo da convivência.\n\n***Jamais se esqueça de que temos no máximo duas páginas no currículo. Desta forma, o foco tem que ser no que importa para se ocupar a vaga pretendida.***\n\n"}]