[{"modified":1665616393445,"order":2,"title":"Mão na Massa","markdown":"Aqui vão alguns exercícios para praticar: \n\n\n\n- [LeetCode 20 - Valid Parentheses](https://leetcode.com/problems/valid-parentheses/)\n- [LeetCode 234 - Palindrome Linked List](https://leetcode.com/problems/palindrome-linked-list/)\n- [LeetCode 1614 -Maximum Nesting Depth of the Parentheses](https://leetcode.com/problems/maximum-nesting-depth-of-the-parentheses/)\n\n*Dica: Leia os problemas com atenção para entender o que deve ser feito e pense nas possíveis soluções antes de escrever o código.*\n\n","url":"3a002b66-a585-42ba-a92e-f14b46349321","created":1665615286993,"type":"text"},{"order":1,"created":1665528430381,"markdown":"Agora que você já sabe o conceito de uma Pilha, suas particularidades e quais são as operações principais, vamos entender um pouco melhor como podemos implementar essa estrutura! <br/>\n\nUma pilha pode ser implementada em diversas linguagens de programação e de diversas maneiras, assim como as demais estruturas de dados. Porém, independente da linguagem ou da implementação é muito importante conseguir garantir as particularidades dessa estrutura. Portanto, para se trabalhar com Pilha e implementá-la em qualquer linguagem, pode-se seguir os seguintes critérios:\n\n1. Criar um ponteiro (*TOP*) que será utilizado para manter armazenado o endereço do elemento do topo;\n2. Ao inicializar uma Pilha, atribuir o valor -1 ao ponteiro (*TOP*). Assim será possível verificar se a Pilha está vazia;\n3. Ao inserir um elemento na Pilha (push), incrementa o valor de *TOP* e posiciona o novo elemento na posição que o ponteiro aponta;\n4. Para remover um elemento (pop), basta retornar o valor que está sendo apontado por *TOP* e decrementar o valor do ponteiro;\n5. Antes de inserir (push), deve-se validar se a Pilha está cheia;\n6. Antes de remover (pop), deve-se validar se a Pilha já está vazia;\n\n![Stack Operations](https://drive.google.com/uc?export=view&id=1fu5D9ptrhXyrpChL1km9SCr5hhhn6Cw9)\n\n","url":"d012c435-5e5c-41a3-afef-024755411923","modified":1665528648459,"title":"Funcionamento de Pilhas","type":"text"}]