[{"markdown":"A definição formal é útil quando você precisa realizar uma *prova matemática*.\nPor exemplo, a complexidade de tempo para ordenação por seleção pode ser definida pela função f(n) = n²/2-n/2 como discutimos na seção anterior.\n\nSe permitirmos que nossa função g(n) seja n², podemos encontrar uma constante c = 1 e a N₀ = 0, e desde que N > N₀, N² sempre será maior que N²/2-N/2. Podemos provar isso facilmente subtraindo N²/2 de ambas as funções, então podemos facilmente ver N²/2 > -N/2 como verdadeiro quando N > 0. Portanto, podemos chegar à conclusão de que f(n) = O(n²), na outra ordenação de seleção é “Big-O quadrático”.\n\nVocê deve ter notado um pequeno truque aqui. Ou seja, se você fizer g(n) crescer rápido, bem mais rápido do que qualquer coisa, O(g(n)) sempre será grande demais.\nPor exemplo, para qualquer função polinomial, você sempre pode estar certo ao dizer que eles são O(2ⁿ) porque 2ⁿ eventualmente superará quaisquer polinômios.\n\nMatematicamente, você está certo, mas geralmente quando falamos sobre Big-O, queremos saber o limite da função (pior caso).\nVocê entenderá isso melhor ao ler a próxima seção.\n\nMas antes de irmos, vamos testar sua compreensão com a seguinte pergunta. A resposta será encontrada em seções posteriores para que não seja um jogo fora.","type":"quiz","url":"ea03455e-d307-46ef-b71d-2c048124f6aa","questions":[{"explanation":"Pense que linhas são uma \"variável\" e colunas é outra.","question":"Uma imagem é representada por uma matriz 2D de pixels. Se você usar um loop *for* aninhado para percorrer cada pixel (ou seja, você tem um loop *for* passando por todas as colunas, depois outro loop *for* dentro para percorrer todas as linhas), qual é a complexidade de tempo do algoritmo quando o imagem é considerada como a entrada?","items":["O(n)","O(n^2)","O(2^n)","",""]}],"created":1664672965863,"order":2,"modified":1664675009270,"title":"Para que serve"},{"markdown":"Era uma vez um rei indiano que queria recompensar um sábio por sua excelência. O sábio não pediu nada além de um pouco de trigo para encher um tabuleiro de xadrez.\n\nMas aqui estavam suas regras:\n* Na primeira peça ele quer 1 grão de trigo;\n* Depois 2 na segunda peça;\n* Depois 4 na próxima…\n\nO rei ingênuo concordou sem hesitar, pensando que seria uma exigência trivial para cumprir, até que ele realmente foi e tentou encher o tabuleiro com grãos de trigo…\n\n![Tabuleiro de xadrez com grãos de trigo](https://drive.google.com/uc?export=view&id=1hf6GShsFOwkG1MKHgZrPQvG8dhSSYVpS)\n\n## Então, quantos grãos de trigo o rei deve ao sábio?\n\nSabemos que um tabuleiro de xadrez tem 8 casas por 8 casas, o que totaliza 64 casas, então a casa final deve ter `2^64` grãos de trigo.\nSe você fizer um cálculo online, acabará obtendo `18,446744 * 10^18`, ou seja, cerca de 18 seguido de 18 zeros.\nAssumindo que cada grão de trigo pesa 0,01 grama, isso nos dá **184.467.440.737 toneladas de trigo**.\n\n\n**A quantidade de trigo da última casa seria equivalente a cerca de 0.0003% da massa total do planeta terra.**\n\n## Crescimento rápido\n\nOs números crescem muito rápido depois para o crescimento exponencial, não é?\nA mesma lógica vale para algoritmos de computador.\nSe os esforços necessários para realizar uma tarefa crescem exponencialmente em relação ao tamanho da entrada, ela pode acabar se tornando enormemente grande.\n\nSe existisse uma 65a casa, o quadrado de 64 é 4096.\nSe você adicionar esse número a `2^64`, ele será perdido fora dos algarismos significativos.\nÉ por isso que, quando olhamos para a taxa de crescimento, nos preocupamos apenas com os termos dominantes.\nE como queremos analisar o crescimento em relação ao tamanho da entrada, os coeficientes que apenas multiplicam o número em vez de crescer com o tamanho da entrada não contêm informações úteis.\n\n## Definição formal de Big O\n\n![Definição formal do Big-O](https://drive.google.com/uc?export=view&id=1r_rxfkLqPmQm5V_LK89USse_gCFttqlx)\n\n","modified":1664674994877,"created":1664671533536,"url":"fbc9d6de-6fad-417a-8386-247b83983001","title":"O que é Big-O exatamente","order":1,"type":"text"}]