[{"questions":[{"question":"Marque a alternativa correta.","items":["Em seu currículo, coloque apenas as informações que podem convencer o recrutador de sua capacidade para preencher a vaga pretendida.","Em seu currículo, coloque apenas as informações que podem convencer o robô de análise de currículos de sua capacidade para preencher a vaga pretendida.","Em seu currículo, coloque informações que podem te ajudar a conquistar a vaga oferecida pela empresa.","Em seu currículo, não deixe de colocar informações que podem te ajudar a conquistar a vaga oferecida pela empresa ainda que tais informações não sejam relacionadas com TI.","Em seu currículo, toda e qualquer informação deve ser colocada, pois é o conjunto de informações sobre suas experiências que podera te favorecer na conquista da vaga cobiçada."],"explanation":"Opa! O que será que houve?"},{"explanation":"Que tal assistir ao vídeo novamente?","question":"Marque a alternativa errada.","items":["Todas experiências - inclusive as que não têm ligação direta com TI - devem ser colocadas no currículo. Isso o enriquecerá.","Experiências, mesmo na área de TI, que não tenham ligação direta com a vaga pretendida deve ficar fora do currículo.","Em seu currículo, coloque apenas experiências que tenham a ver com TI.","Tire de seu currículo toda informação que nada tenha a ver com TI.","Se a vaga é de DBA, coloque em seu currículo suas experiências de atuação neste papel. Experiências em outras áreas de atuação não devem aparecer em seu currículo."]}],"modified":1639864751122,"title":"Teste seu conhecimento","markdown":"Responda o que se pede.","type":"quiz","url":"3d9b61b9-486e-4ffa-bb97-f5a52004776e","created":1639857150805,"order":4},{"modified":1639916576868,"videoId":"nLFy20SF8hk","markdown":"**É preciso ser criterioso na hora de informar suas experiências profissionais.**","created":1639317798769,"type":"youtube","order":1,"title":"Introdução","moreMarkdown":null,"url":"587a7c11-99ea-4b6a-badf-8730c1b61908"},{"order":3,"type":"text","title":"O que tirar e o que deixar","created":1639317672445,"modified":1639856876128,"url":"acaa6689-bce6-494d-a479-b8f226e3e0f7","markdown":"**Ficam de fora:**\n \n**1) experiências que não são da área de TI (gerente de banco, corretor imobiliário, engenheiro civil etc.).**\n \nTais experiências:\n\n* nada agregam para que você ocupe a vaga pretendida;\n* podem gerar confusão na cabeça do recrutador.\n\nUma confusão possível seria o recrutador se sentir desconfortável em te contratar temendo que você queira voltar para uma das áreas em que você já atuou.\n\n**2) experiências de TI não relacionadas diretamente com a vaga cobiçada.**\n\nOlhe para a descrição da vaga que você pretende ocupar e coloque no seu currículo experiências que te capacitam a ocupá-la.\n\nJamais se esqueça de que o recrutador tem pouco tempo para avaliar seu currículo. Ele precisa **\"bater o olho\"** e ver que você já atuou e/ou atua em áreas diretamente relacionadas à vaga que ele quer preencher.\n\nVocê só precisa mostrar para o recrutador que você pode preencher aquela vaga. Informar mais sobre você ficará para outro momento.\n\n"},{"created":1639319399277,"title":"Definindo o critério","type":"text","order":2,"url":"d84d1a6d-7c15-4a6a-a530-e836d68b4957","markdown":"### Para definir as experiências relevantes que devem ser colocadas no seu currículo, você precisa responder a uma pergunta com o máximo de clareza e objetividade:\n\n**Esta informação tem relação direta com a vaga que pretendo preencher?**\n\n* Se a resposta for SIM, entra no currículo.\n* Se a reposta for NÃO, não entra no currículo.\n* Se tiver dúvida se é SIM ou se é NÃO, opte por deixar tal informação de fora. \n\nOs recrutadores procuram profissionais que atendam os requisitos da vaga disponibilizada.\n\nQuem manda, então, é a **vaga** e é preenchê-la que deve basear a construção do seu currículo: **Eu tenho experiência e quero ocupar esta vaga.**","modified":1639857342743}]