[{"url":"1bcfc3be-8372-43f2-ba20-7916c9e82d89","modified":1638269462821,"title":"Como é a elaboração do currículo aqui e fora daqui?","type":"text","created":1637706397963,"order":2,"markdown":"**A elaboração de um currículo não é igual em todos os lugares.**\n\n* Em alguns lugares, a apresentação (quantidade de páginas, gramatura do papel, capa, peso etc.) conta muito. Nesses currículos, as informações relevantes sobre o candidato a uma vaga devem ser encontradas ao longo de uma demorada leitura.\n\n* Em outros, o que conta mesmo é que, no currículo, sejam encontradas - por meio de uma leitura o menos demorada possível - as informações relevantes a respeito do candidato a uma vaga."},{"videoId":"XZc1M8SL-Yc","order":3,"created":1638138816752,"modified":1638269684219,"markdown":"","url":"50a916b1-f070-41f0-9241-83210abe47d6","title":"Dois limites a serem observados","moreMarkdown":"***Limite um: Quem tem menos de 10 anos de experiência, tem currículo de uma página.***\n\n***Limite dois: Quem tem mais de 10 anos de experiência, tem currículo com duas páginas, no máximo.***","type":"youtube"},{"order":5,"markdown":"* **Sabem** que é possível se otimizar o currículo.\n* **Querem** que as informações relevantes sejam dadas de graça ao recrutador, ou seja, ele não precisa estudar o currículo.\n* **Já comprovaram** que é possível colocar em uma página toda informação - mastigada - que interessa ao recrutador.\n* **Procuram** currículos nos quais só haja informações que realmente precisam estar lá.\n* **Exigem** que o candidato à vaga ordene e priorize as informações no currículo.\n* **Buscam** currículos que mostram tudo o que o recrutador precisa ver em, no máximo, seis segundos de leitura. ","modified":1638150316005,"type":"text","created":1637706417788,"title":"Na gringa","url":"90022241-2a39-4ae5-8836-211d76f09b95"},{"moreMarkdown":null,"videoId":"i0D4Riyf7M4","markdown":"Entenda como funciona fora do Brasil","created":1638138634609,"title":"Introdução","order":1,"modified":1638150492351,"url":"b3ebf614-7f1f-4a0c-913a-725d6f2fd2ca","type":"youtube"},{"created":1637889957451,"order":6,"markdown":"fsdfsdfsd","title":"Teste seu conhecimento","url":"cc27067f-9177-4173-bc0f-07f525e6eacb","modified":1638149586248,"type":"quiz","questions":[{"question":"A cultura de preparação de currículos no Brasil:","explanation":"Se for preciso, assista novamente ao vídeo.","items":["é totalmente diferente da cultura de preparação de currículos fora do Brasil.","é diferente da cultura de preparação de currículos nos EUA.","é diferente da cultura de preparação de currículos no Canadá.","é diferente da cultura de preparação de currículos nos países da europa.","é diferente da cultura de preparação de currículos na Austrália."]},{"question":"Os recrutadores gringos:","items":["querem tudo às claras, explícitos e de fácil localização no currículo, principalmente as informações relevantes.","buscam encontrar currículos ordenados e priorizados.","tiram muitas coisas que não precisam estar nos currículos.","têm a atenção atraída por fontes grandes e chamativas.","gostam de ler currículos grandes, pois este é o serviço deles."],"explanation":"Houve algum problema?"},{"items":[" A concisão do currículo dando as informações relevantes ao recrutador no máximo em uma página aumenta muito a chance de ser selecionado.","A concisão do currículo é garantia de que ele será selecionado pelo recrutador.","É só fazer o currículo diferente da forma como é feito no Brasil que os gringos vão selecioná-lo.","Os gringos otimizam e reordenam seu currículo para poderem encontrar as informações relevantes nele.","Se o seu currículo estiver em uma página, sua chance de ser selecionado aumenta muito."],"explanation":"Você esqueceu o que ouviu no vídeo?","question":"Marque a alternativa correta."}]},{"created":1637706410098,"modified":1638152390049,"order":4,"title":"No Brasil","markdown":"* Ainda prevalece a cultura de currículos grandes, apresentados em várias páginas.\n* Digitais ou físicos, currículos elaborados para serem estudados pelo recrutador.\n* Se físicos, importância dada à apresentação (papel de ótima qualidade, capa, fotos etc.).\n* Currículos que dão trabalho ao recrutador.","type":"text","url":"e8061de0-d9b5-481e-b421-94f4e5636bcb"}]