[{"questions":[{"items":["Lista","Fila","Pilha","Array",""],"question":"Se, na entrevista, for proposto um problema sobre a compra de vários produtos em uma loja, a estrutura de dados a ser usada é provavelmente:","explanation":"Quando você vai ao supermercado, você faz uma... ?"},{"explanation":"Redes são nós que se conectam uns aos outros. Isso é um...","question":"Se, na entrevista, for proposto um problema sobre uma rede de computadores, a estrutura de dados a ser usada é provavelmente:","items":["Grafo","Array","Árvore","",""]},{"items":["Fila","Lista","Pilha","Array",""],"question":" Se, na entrevista, for proposto um problema sobre clientes nos caixas de um mercado para fazerem pagamentos, a estrutura de dados a ser usada é provavelmente:","explanation":"Em caixas de lojas, os clientes fazem uma..."},{"explanation":"Outros tipos numéricos.","items":["short e long","short e tall","small e long","small e tall",""],"question":"São quatro os tipos primitivos, mas os \"integers\" também englobam os:"},{"items":["doubles","singles","triples","numbers",""],"question":"São quatro os tipos primitivos, mas os \"floats\" também englobam os:","explanation":"Outros tipos numéricos."},{"question":"Tipos primitivos também são:","explanation":"Assista o vídeo da classificação com o professor indiano.","items":["Atômicos","Não atômicos","","",""]},{"items":["A partir de tipos primitivos.","Completamente do zero.","","",""],"explanation":"Assista o vídeo da classificação com o professor indiano.","question":"Todo tipo composto, internamente são estruturas criadas:"},{"explanation":"Nem toda estrutura de dados se diferencia na forma como são usadas. Assista o vídeo da classificação com o professor indiano.","items":["Como são salvas fisicamente na memória.","Como os dados são acessados pelos engenheiros de software.","","",""],"question":"Nas estruturas de tipo composto, estruturas similares ainda se diferenciam na forma:"},{"explanation":"Será que precisa saber isso?","question":"A maior diferença entre estruturas de dados lineares e não lineares é:","items":["Não precisa saber diferenciar estruturas lineares e não lineares para processos seletivos.","As diferenças são incontáveis. Não tem uma mais importante.","Existe apenas uma diferença, mas eu não me lembro qual.","Não entendi o que o professor indiano disse nessa parte.",""]}],"created":1662422207589,"markdown":null,"modified":1663535306060,"title":"Teste seu conhecimento","url":"3ebea646-aab1-4384-910e-33b4f0a854e6","type":"quiz","order":6},{"order":3,"url":"8a257c83-503f-4c64-81c6-457f9505d94c","videoId":"PIty_7OsM8g","type":"youtube","markdown":"A população de indianos em TI no exterior é enorme. É importante ir se acostumando com o sotaque deles.\n\nNa hora da entrevista, é importantíssimo entender o que o entrevistador disser. E é muito provável que você seja entrevistado por um indiano em algum momento.","modified":1662429812691,"title":"Classificação (com sotaque indiano)","moreMarkdown":"\n\nAssista o vídeo acima, prestando muita atenção e tentando acompanhar o que o professor vai explicando, sem usar legendas.","created":1662429664231},{"created":1662422029268,"order":2,"title":"Tipos - Quais são","markdown":"Os **tipos primitivos são apenas quatro**, mas os **tipos compostos são incontáveis**. Existem quatro subtipos compostos principais: conjuntos estáticos (arrays), conjuntos dinâmicos, árvores e grafos. Os conjuntos dinâmicos são filas, listas e pilhas.\n\n\n![Diagrama dos tipos](https://drive.google.com/uc?export=view&id=1OKST1yq_PHHhxugcBTzYZzxSu4BzCfNO) ","modified":1662426412723,"url":"9382e248-6a36-4996-af92-74b8a6517b36","type":"text"},{"markdown":"Numa entrevista técnica, você vai precisar identificar qual é a estrutura de dados principal e qual estrutura de dados auxiliar pode ser usada para resolver o problema. É fundamental identificar com clareza e rapidamente essas estruturas.\n\nExiste uma lógica geral em que problemas de \"lista de compras\" sejam resolvidos com listas. Problemas de \"filas de pessoas\" sejam resolvidos com filas. Então tente encontrar as dicas que o próprio problema deixa. As estruturas de dados são nomeadas de acordo com problemas do mundo real.","type":"text","title":"Identificar os tipos","modified":1662422374970,"url":"aa21226b-97ce-4a98-8067-9a1508f4d5a3","order":1,"created":1662421947718},{"moreMarkdown":null,"created":1663534665722,"videoId":"08mQTusSbdM","title":"O que você aprendeu","markdown":null,"modified":1663534678653,"type":"youtube","url":"efc4d3cf-9a4a-466a-8fe6-2ea19a033a3a","order":5}]