[{"type":"quiz","title":"Teste seu conhecimento","markdown":null,"created":1639864526509,"url":"157fc5e7-44ac-48e4-bd69-7926626d57b5","questions":[{"question":"Marque a alternativa correta.","items":["No currículo, os cargos desempenhados e as descrições de tais cargos devem ficar bem à vista do recrutador.","No currículo, basta colocar os cargos desempenhados o mais à vista do recrutador.","No currículo, basta colocar as descrições dos cargos desempenhados o mais à vista do recrutador.","No currículo, não precisa ter muito critério ao colocar os cargos desempenhados, pois o recrutador tem habilidade para vê-los por meio de uma rápida leitura.","As informações que estão no currículo devem ser vistas pelo recrutador uma vez que esse é o papel dele."],"explanation":"Errou por quê?"}],"order":4,"modified":1639864529686},{"title":"Segunda estratégia","markdown":"### A segunda estratégia é descrever, com o máximo de clareza que, ao longo de sua carreira, sua responsabilidade foi aumentando nas atividades que você executou. ###\n\nAqui, o essencial é usar as palavras-chave próprias.\n\nPalavras-chave que podem ser utilizadas:\n\n**1) por quem está no início da carreira:**\n\n* ajudar\n* apoiar\n* auxiliar\n* cooperar\n\n**2) por quem é mais experiente:**\n\n* ser responsável por\n* ser encarregado de\n* garantir\n* manter\n* coordenar\n* monitorar\n* liderar","order":3,"url":"57065537-733a-4775-9202-6bb37a0af444","type":"text","modified":1639860618997,"created":1639315299814},{"order":2,"url":"99add0bd-9ba2-49f2-8617-e9a58086f3be","title":"Primeira estratégia","created":1639314978007,"modified":1639861500262,"markdown":"**A primeira estratégia é destacar os títulos dos cargos que você já ocupou.**\n\n### Basicamente, há dois tipos de progressão profissional: ###\n\n**Tipo 1 -** progressão profissional em uma mesma empresa.\n\nAqui, o candidato deve:\n\n* demonstrar sua progressão deixando clara sua evolução profissional ao longo do tempo na empresa;\n\n* destacar as promoções que recebeu e os cargos que assumiu na empresa que exigiam mais de você.\n\nPor exemplo:\n\n- Promovido de estagiário para efetivo (ou contratado).\n- Promovido de Pleno para Sênior.\n- Assumiu cargo de Tech Lead.\n\n**Tipo 2 -** progressão profissional ao longo da carreira em várias empresas.\n\nAqui:\n\n* os títulos devem mostrar que as mudanças de empresa geraram maior responsabilidade nas funções atribuídas ao candidato;\n\n* as experiências devem demonstrar evolução na carreira do candidato.","type":"text"},{"markdown":"O objetivo desta lição é te ensinar a mostrar para o recrutador o caminho que você trilhou para chegar onde você está hoje.","moreMarkdown":"","url":"99e12dcd-52f5-46d8-9700-dc44c4a79d4c","created":1639314102312,"videoId":"LSfTAGhVn40","order":1,"modified":1639440521640,"type":"youtube","title":"Deixe clara sua progressão profissional"}]