[{"order":3,"created":1664675976657,"markdown":null,"questions":[{"items":["Sim, e em entrevistas técnicas, o pior caso é o que mais importa.","Sim, e em entrevistas técnicas, a média é o que mais importa.","Sim, e em entrevistas técnicas, o melhor caso é o que mais importa.","Não",""],"explanation":"Assista o vídeo da Keerti Purswani","question":"Algoritmos podem ter cenários diferentes, como \"melhor\", \"média\" e \"pior\" casos."},{"items":["Em caso de colisão, retornam os elementos considerados iguais na ordem original.","Os casos \"pior\", \"médio\" e \"melhor\" são considerados idênticos.","Rodam na mesma velocidade independentemente do tamanho da entrada de dados.","",""],"question":"Algoritmos de ordenação são considerados estáveis quando:","explanation":"Assista o vídeo da Keerti Purswani"},{"explanation":"Assista o vídeo da Keerti Purswani","items":["Sim","Não","","",""],"question":"No pior caso, Merge Sort é mais rápido que Buble Sort."},{"question":"A maior diferença entre Merge Sort e Heap Sort é.","items":["A complexidade de espaço.","A complexidade de tempo.","Um é estável e o outro não.","",""],"explanation":"Um é estável e o outro não, mas essa é a maior diferença? Assista o vídeo da Keerti Purswani."}],"url":"3c5d79ca-724b-4f68-adca-6a095aa8cd55","title":"Teste seus conhecimentos","type":"quiz","modified":1664676394567},{"order":2,"markdown":"Os algoritmos de ordenação são muito usados no universo do Big-O e são uma excelente ferramenta para testar seus conhecimentos.\n\nEstes algoritmos também são muito usados durante entrevistas, pois são capazes de tocar em conhecimentos específicos sobre Big-O de candidatos.\n\nAssista o vídeo da Keerti Purswani abaixo até o fim para entender detalhes da complexidade de tempo e espaço de vários algoritmos de ordenação famosos.\nAproveite para ir se acostumando com o sotaque indiano.","height":null,"title":"Algoritmos de ordenação","moreMarkdown":null,"videoId":"4gW6P5A1gxs","modified":1664675930968,"url":"c1d17660-ac39-46e8-a2dd-eb83fd496957","created":1664675748016,"authorUser":null,"type":"youtube","codePenId":null},{"created":1664675621339,"title":"Diferenças e semelhanças","order":1,"type":"text","url":"ff4fe4e0-2739-44ea-9aba-3bb2a82fbc78","modified":1664675624222,"markdown":"Até agora, discutimos apenas a complexidade de tempo dos algoritmos.\nOu seja, nos importamos apenas com quanto tempo leva para o algoritmo concluir a tarefa.\nO que também importa é **o espaço que o algoritmo ocupa para completar a tarefa**.\n\nA complexidade do espaço está relacionada com a quantidade de memória que o algoritmo irá utilizar e, portanto, também é um fator importante a ser analisado.\n\nA complexidade de espaço funciona de forma semelhante à complexidade do tempo.\nPor exemplo, a ordenação por seleção tem uma complexidade de espaço de O(1), pois armazena apenas um valor mínimo e seu índice para comparação, o espaço máximo utilizado não aumenta com o tamanho da entrada.\n\nAlguns algoritmos, como *Bucket Sort*, têm uma complexidade de espaço de O(n), mas são capazes de reduzir a complexidade de tempo para O(1).\n*Bucket Sort* classifica a matriz criando uma lista ordenada de todos os elementos possíveis na matriz e, em seguida, incrementa a contagem sempre que o elemento é encontrado.\nNo final, o array ordenado será os elementos da lista ordenada repetidos por suas contagens."}]