[{"title":"LinkedList","moreMarkdown":null,"modified":1667265840153,"order":5,"videoId":"MuwxQ2IB8lQ","created":1665530049182,"type":"youtube","markdown":"Uma outra maneira para implementação concreta de pilhas é por meio de *linkedlist*. <br/>\n\n\nPor se tratar de uma estrutura de dados dinâmica, a implementação de um pilha baseada em uma linkedlist, carrega consigo o benefício da ampliação da estrutura, caso necessário.\nPor outro lado pode-se considerar que a implementação se torna um pouco mais complexa.\n\nVeja o vídeo abaixo do canal *mycodeschool* para entender essa implementação, aproveite para se acostumar com o sotaque indiano!","url":"69b60d26-8d87-4e4f-b040-763f7373ccd0"},{"type":"youtube","modified":1667265603242,"moreMarkdown":null,"videoId":"sFVxsglODoo","markdown":"Uma maneira para implementação concreta de pilhas é por meio de *arrays*. <br/>\n\nComo já é sabido, array é uma estrutura de dados indexada o que nos permite saber a posição de todos os elementos dentro dessa estrutura, porém, quando se trata da implementação de um pilha, só é necessário ter o conhecimento da posição que representa o topo da pilha.\n\n\nComo ponto positivo para utilização de array pode-se destacar a fácil implementação. Por outro lado, como ponto de atenção, pode-se destacar as limitações próprias de um array, como por exemplo o tamanho fixo.\n\nVeja o vídeo abaixo do canal *mycodeschool* para entender essa implementação, aproveite para se acostumar com o sotaque indiano!","url":"75df2cf5-5104-40f5-83e2-5cd521189f77","title":"Array","order":4,"created":1665529689199},{"created":1665191418321,"order":1,"modified":1667266271112,"url":"9495c00d-95ab-48c9-83e4-b3b5f947b565","title":"Tipos de Implementações","markdown":"Um pilha é uma estrutura de dados abstrata que obedece algumas regras como visto anteriormente. Portanto, é preciso encontrar formas de se implementar essa estrutura para conseguir garantir esse comportamento. <br/>\n\n***Definição***: Uma estrutura de dados abstrata é uma estrutura a qual é definida por um conjunto de operações que especificam o seu comportamento, mas não como são implementadas. Nessa lição você verá que existe mais de uma forma para se implementar a estrutura de dados pilha, no entanto, o comportamento de ambas implementações é o mesmo. <br/>\n \nPois bem, existem duas formas de se implementar essa estrutura e são as seguintes:","type":"text"},{"modified":1667267418186,"created":1665614624641,"title":"Teste seus conhecimentos","markdown":null,"url":"a45a5c92-db03-4978-b295-45bacb3fb5b7","questions":[{"items":["Errado","Certo","","",""],"question":"Independente da forma como uma Pilha é implementada o armazenamento na memória será igual? ","explanation":"Reveja os vídeos sobre as implementações"},{"explanation":"Reveja os vídeos sobre as implementações","question":"Sobre complexidade de tempo das implementações, é correto afirmar que:","items":["Para ambas implementações, as operações são realizadas em O(1)","Implementar pilhas utilizando Array é mais eficiente","Implementar pilhas utilizando LinkedList é mais eficiente","",""]},{"explanation":"Lembre-se do conceito de estrutura de dados abstrata","items":["Errado","Certo","","",""],"question":"Implementar uma Pilha utilizando um Array possibilita ter mais funcionalidades "},{"explanation":"Lembre-se do conceito de estrutura de dados abstrata","items":["Ambas possuem as mesmas manipulações de dados","Array dá mais opções","LinkedList dá mais opções","",""],"question":"Qual implementação permite manipular melhor os dados de um Pilha"},{"items":["É preferível implementar com LinkedList em cenários de maior flexibilidade de tamanho.","Implementar usando LinkedList será sempre melhor pois tem uma melhor performance para acessar o primeiro elemento.","Implementar com Array pode ser um problema para conseguir acessar o primeiro elemento.","Implementar usando Array será melhor para armazenar uma quantidade desconhecida de elementos.",""],"question":"Sobre as implementações é correto afirmar que","explanation":"Assista novamente os vídeos do canal mycodeschool."},{"explanation":"Lembre-se que LinkedList é uma estrutura de dados dinâmica.","question":"Pode-se citar a seguinte vantagem para implementar uma pilha usando **LinkedList**","items":["Mais liberdade para aumentar o tamanho da pilha.","Melhor performance em relação ao array.","Acesso direto ao elemento do topo.","",""]},{"question":"Pode-se citar a seguinte vantagem para implementar uma pilha usando **Array**","items":["Para a mesma quantidade de elementos, arrays usam menos memória.","Por ser uma estrutura indexada, o acesso ao primeiro elemento é mais rápido.","Operações de inserção e deleção são mais rápidas em arrays do que LinkedLists.","",""],"explanation":"Lembre-se que uma LinkedList precisa armazenar o valor e o endereço do próximo elemento."}],"type":"quiz","order":6}]