[{"type":"quiz","questions":[{"question":"Marque a alternativa incorreta.","items":["O recrutador tem obrigação de contextualizar as informações contidas no currículo do candidato, pois é ele (o recrutador) quem procura alguém para preencher a vaga da empresa que ele representa.","O candidato deve contextualizar toda e qualquer experiência profissional apresentada em seu currículo.","Sem contextualizar o cargo de diretor de TI do Bradesco - por exemplo - no currículo, para os gringos tal informação pouco ou nada adiantará.","No Brasil, a contextualização do cargo diretor de TI do Bradesco, por exemplo, não precisa ser feita.","Nada o candidato perde contextualizando suas experiências profissionais para que seu currículo seja analisado por gringos."],"explanation":"Epa! Houve um problema aqui."}],"order":4,"modified":1639947016530,"markdown":null,"created":1639946651563,"url":"0355893e-f21f-4a59-b504-7a0e96e76148","title":"Teste seu conhecimento"},{"order":1,"moreMarkdown":null,"videoId":"dqj640N9mU4","modified":1639919521884,"url":"1abf982f-4f84-4111-b277-35e850948dc1","markdown":null,"type":"youtube","title":"Contextualize a importância de suas experiências profissionais","created":1639065859407},{"url":"cb0b7f14-61b1-4562-95b4-7e62f7823506","created":1639946130894,"type":"text","order":3,"markdown":"**O recrutador quer tudo o mais mastigado possível.**\n\n* Ele tem centenas de currículos para ler e, por isso, não vai pesquisar qual empresa seria equivalente à Caixa Econômica Federal nos EUA ou no Canadá, por exemplo;\n","title":"O recrutador","modified":1639946130894},{"modified":1639920800727,"markdown":"**\"Fui diretor de TI da Caixa Econômica Federal.\"**\n\n* No Brasil, essa informação tem muita importância, pois, a rigor, todos sabem que empresa é essa.\n\n* Na gringa, essa informação tem tudo para não ter importância, pois, a rigor, o recrutador não sabe que empresa é essa.\n\n\n### Duas formas possíveis de se contextualizar essa informação: ###\n\n1) **\"Fui diretor de TI da Caixa Econômica Federal, um dos maiores bancos da América Latina.\"**\n\n2) **\"Fui diretor de TI da Caixa Econômica Federal, banco equivalente ao banco X no Canadá e ao banco Y nos EUA.\"**","order":2,"type":"text","title":"É preciso contextualizar as experiências profissionais","created":1639919955701,"url":"f549dfb0-7f7c-4e06-b44c-ce7ee9017a36"}]