[{"questions":[{"question":"Sobre a forma como arrays são alocados na memória é possível afirmar que:","explanation":"Lembre-se da função de um índice em um array.","items":["Um elemento de um array é identificado unicamente pelo seu índice ou endereço que ocupa na memória","Cada elemento de um array armazena o endereço/índice do próximo elemento","Um elemento de um array é unico pois nenhum outro elemento pode conter o mesmo valor","Arrays são estruturas sequenciais, ou seja, o valor do elemento seguinte deve ser maior que o anterior",""]},{"items":["Salvar as letras do alfabeto em português","Criar uma lista de usuários de um sistema on-line que recebe novos cadastros diariamente","Manter histórico de preço de um produto no estoque virtual","Registrar placas de todos os carros capturados por um pardal",""],"explanation":"Lembre-se que é necessário informar o tamanho do array no momento da sua criação","question":"É recomendado utilizar um array no seguinte caso:"},{"explanation":"Leia novamente o bloco **Você Sabia?**","items":["Não. Arrays não tem um bom desempenho quando precisa aumentar o tamanho","Sim. Array é uma estrutura coringa e, por isso, reaje bem a esse cenário","Depende do tamanho que o array deve aumentar, já que o sistema saberá alocar apenas o suficiente sem alocar memória que não será utilizada","",""],"question":"Se, durante a entrevista, você precisar de uma estrutura que crescerá a cada iteração, é recomendado utilizar array?"},{"items":["LinkedList","Array","Set","HashMap","Tree"],"explanation":"Leia o primeiro capítulo do livro Grokking Algorithms","question":"Se, durante a entrevista, você precisar de uma estrutura que crescerá a cada iteração, qual estrutura poderia ser uma alternativa?"}],"url":"3aa2a136-8039-49c0-81b6-ede7bc2dd2d4","order":4,"type":"quiz","created":1663122295645,"modified":1663614060205,"markdown":null,"title":"Teste seus conhecimentos"},{"title":"Funcionamento da memória","modified":1663429626528,"url":"8484b40c-8c78-4a45-8f1d-a618d27115f9","created":1663121197463,"type":"text","markdown":"Um array é uma estrutura de dados alocada de maneira sequencial na memória, a ideia é alocar vários itens, do mesmo tipo, juntos na memória.\nTendo um conjunto de elementos em sequência torna mais fácil calcular a posição de um elemento qualquer utilizando uma simples adição ao elemento base.\n\n![Alocação de memória do array](https://drive.google.com/uc?export=view&id=1ZMJwqvrZpAvHXGHk5Cpao7KsiKX8-jCm)\n\n\nLembra que o array é uma estrutura indexada? Pois é! Os índices identificam, unicamente, um elemento dentro de um array. ","order":1},{"type":"text","url":"b1833db4-ecc5-4b16-b464-7e503659c098","modified":1663332357833,"title":"Strings","created":1663254014931,"markdown":"No módulo anterior você aprendeu que Strings são um tipo de dados composto, pois contém uma ***cadeia sequencial de caracteres***. Agora que você aprendeu sobre a estrutura de dados array, consegue enxergar alguma ligação entre essa estrutura e a frase: *cadeia sequencial de caracteres*? \n\nSim, Strings são arrays de caracteres! Ou seja, na memória quando criamos uma String *TechJob* é o mesmo que criarmos um array de caracteres contendo as mesmas letras da String.\nIsso quer dizer que:\n- A variável do tipo String aponta para uma referência da posição inicial da String na memória  \n- Cada letra da String está armazenada em uma célula diferente da memória e de forma sequencial\n\n\n**Importante**: Assim como acontece com arrays, é preciso ter atenção ao utilizar Strings para evitar uso de memória desnecessário.","order":3},{"created":1663121673073,"markdown":"Apesar de ser uma estrutura de simples entendimento, a má utilização de um array pode se tornar muito custoso para a sua solução. Pois toda vez que um elemento precisa ser adicionado à um array e esse já está com sua capacidade máxima atingida, o sistema irá criar um novo array de tamanho n+1 ou n*2(dependendo da linguagem) e copiar todos os elementos da estrutura original para a nova um a um.\n\nPortanto, se sua solução precisa de uma estrutura que vai ter muitas inserções e deleções, um array provavelmente não é uma boa escolha.\nPor outro lado, array são ótimos quando a solução depende de uma estrutura de dados que não varia em tamanho(ou varia pouco), onde você conheça os índices dos elementos e seja capaz de acessá-los diretamente.","type":"text","order":2,"modified":1663123483712,"url":"f962f8b8-ffb5-4fc8-990a-76395a6e057e","title":"Você Sabia?"}]