[{"questions":[{"items":["O peek() apenas consulta sem remover o elemento, já o pop() consulta e remove o elemento","O peek() deve ser utilizado caso deseje saber qual é o primeiro elemento, e o elemento em seguida dele","O pop() deve ser utilizado para consultar um elemento sem realizar nenhuma ação extra","",""],"explanation":"Relembre o conceito dessas operações","question":"Quando realizar um peek() ou um pop()?"},{"items":["As operações são igualmente custosas e isso não precisa ser um critério de desempate, mas sim o padrão seguido para inserção e deleção de elementos.","Cada operação tem um peso (custo) diferente e, por isso, é importante se atentar à operação mais realizada para cada cenário","Como a operação de escrita é mais custosa que a operação de leitura, é preferível o uso de pilhas em cenários onde a leitura é mais utilizada. ","",""],"explanation":"Relembre o Big-O de cada operação e a usabilidade da estrutura Pilha","question":"Sobre o custo das operações, é correto afirmar que:"}],"type":"quiz","order":2,"url":"41416ddd-a693-45bd-876b-432b4108010e","title":"Teste seus conhecimentos","markdown":null,"modified":1665615173641,"created":1665614841087},{"modified":1665194125259,"created":1665193901931,"url":"a6eb5b2b-78b7-47d4-8174-d70ed14dc875","markdown":"Para manipular elementos dentro de uma pilha pode-se utilizar as seguintes operações:\n\n1. Inserção (*push()*)<br/>\nInsere um novo elemento na pilha. Caso a pilha esteja cheia se trata de um *Overflow*.\n\n2. Leitura (*peek()*)<br/>\nConsulta o elemento do topo da pilha.\n\n3. Deleção (*pop()*) <br/>\nRemove um elemento do topo da pilha. Nesse caso o elemento do topo da pilha é consultado e ***excluído***. Caso a pilha esteja vaiza se trata de um *Underflow*.\n\n4. *isEmpty* <br/>\nVerifica se a pilha contém algum elemento ou se está vazia.\n\nTodas as operações de uma pilha são realizadas no elemento que se está no topo da pilha. Considerando as implementações possíveis, tanto na utilização de *array*, quanto na utilização de *linkedlist*, o endereço do elemento do topo da pilha é conhecido e, portanto, é acessado diretamente. Sendo assim, chegamos a conclusão que **todas as operações possuem O(1)** .\n\n","order":1,"title":"Principais Operações","type":"text"}]