[{"questions":[{"question":"O que é um array?","items":["Uma estrutura de dados fixa que armazena valores do mesmo tipo em um espaço de memória definido","Uma estrutura de dados otimizada para resolver qualquer problema de entrevista técnica","Uma estrutura de dados que identifica posições aleatórias da memória com índices","Um estrutura de dados complexa que não é utilizada para resolver problemas de entrevistas técnicas",""],"explanation":"Lembre-se do conceito de um array"},{"items":["Não","Depende da linguagem","Sim","",""],"question":"É possível criar um array contendo mais de um tipo de dados, seja ele primitivo ou composto?","explanation":"Lembre da criação de um array."}],"markdown":"","created":1663120436480,"url":"66c2e319-1abd-457e-b633-fee8e7bb3c44","type":"quiz","order":2,"title":"Teste seus conhecimentos","modified":1663350649865},{"url":"dc025ec2-3696-4919-a5dd-d30fa607fe4c","markdown":"**Neste módulo você irá entender o que, de fato é um Array, os tipos de array, quando e como aplicar essa estrutura de dados.**\n\nUm array é um arranjo, uma estrutura de dados a qual pode-se armazenar vários dados do mesmo tipo. Dentro de um mesmo array não é possível ter tipos de dados diferentes, ou seja, é possível criar um array de inteiros, um array de boolean, um array de Strings etc... Observe que não é possível incluir um boolean num array de inteiros.\n\nSabendo que um array armazena um conjunto de informações do mesmo tipo, é importante saber como funciona esse armazenamento (esse tema será detalhado melhor na próxima lição). Por hora, irei ressaltar apenas que um array é uma estrutura de dados de **tamanho fixo**, portanto, ao criar um array você deverá definir a quantidade de elementos que pretende adicionar nessa estrutura. Vale ressaltar que caso você utilize uma linguagem que permite declarar um array sem informar o tamanho \"por debaixo dos panos\" essa linguagem define um tamanho padrão para esse array.\n\nIsso é importante pois o array é uma estrutura indexada, sendo assim é possível acessar diretamente um elemento qualquer. Esse índice nada mais é que o endereço da memória que a estrutura está alocada.\n\n","order":1,"title":"O que você vai aprender","modified":1663613409385,"created":1663118871534,"type":"text"}]