[{"modified":1662951943093,"markdown":" **A necessidade de adaptação do currículo**","created":1637273376992,"url":"3GqK2uCdw661D2MHLJnH","type":"youtube","videoId":"TDWqCOTZ1qs","order":1,"moreMarkdown":"\n**Atrair o robô de análise de currículos e o recrutador são os dois aspectos fundamentais necessários para que você adapte seu currículo.**\n\nSelecionado pelo **robô**, um **recrutador** (uma pessoa humana) vai pegar seu currículo e vai lê-lo de forma bem rápida (Lembre-se de que o tempo médio que ele usa para isso são seis segundos) Você viu isso na [Introdução do curso](https://tech-job-no-exterior.github.io/tech-job-site-curso-prod/#/page/course/como-preparar-curriculo), não viu?","title":"Entenda o porquê"},{"title":"A análise do recrutador","url":"5a1ded90-4cbf-4e3f-a5c7-ec3a1f83b3a1","order":3,"markdown":"* O **recrutador** recebe a lista já pré-analisada pelo **robô**.\n\n* Os melhores candidatos em cima. Os demais embaixo.\n\n* O **recrutador** começa pelos candidatos de cima, fazendo uma leitura dinâmica de alguns segundos e já os qualificando ou os desqualificando.\n\n* Em seu currículo, o **recrutador** precisa ver o que o **robô** viu. Acontecendo isso, sua chance de avançar no processo é grande. Se não, você já está fora do processo.","modified":1638042737796,"created":1637934868820,"type":"text"},{"type":"text","url":"99c0198e-207d-44da-a0ad-8270d8362dc7","markdown":"* **O robô** não é um ser concreto. É um sistema que analisa os currículos (em PDF, Doc.com...) que são enviados para as empresas ou que estão disponibilizados no LinkedIn, Monster... ou em algum site de empregos.\n\n* Ele lê o currículo e lista palavras-chave e informações relevantes simulando que é uma pessoa que está lendo. Enquanto lê, ele vai pontuando o currículo.\n\n* A pontuação dada pelo **robô** já qualifica ou desqualifica a pessoa para o cargo que ele quer ocupar.\n\n* O seu currículo precisa dizer ao **robô** que você é a pessoa que pode preencher a vaga que ele quer preencher.\n\n* Se a forma como você montar seu currículo não convencer o **robô** de que você tem o que ele procura, você está desqualificado.\n\n* Pode acontecer de você ter o que o **robô** procura, mas isso precisa estar lá de forma que ele veja. Tem que estar explícito, visível. Preto no branco.\n\n* Se o seu currículo não estiver adaptado para que o **robô** veja o que ele precisa ver, seu currículo não passa para a fase seguinte: ser selecionado para ser lido por um recrutador.","title":"A análise do robô","modified":1638042798140,"order":2,"created":1637626459760},{"url":"9b8043b0-0e4f-470c-8826-a1274e2736de","questions":[{"explanation":"Cuidado com os detalhes!","items":["As palavras-chave e as informações relevantes encontradas serão base para o recrutador decidir.","O robô lê o seu currículo como se fosse o próprio recrutador.","O robô lê apenas o currículo que você envia para a empresa na qual você pleiteia uma vaga.","O robô já define se a vaga é sua ou não.","Somente as palavras-chave e as informações relevantes são lidas pelo robô."],"question":"O robô de análise de currículos:"},{"items":["passar no crivo tanto do robô quanto do recrutador.","passar no crivo do robô.","passar no crivo do recrutador.","para seu currículo ser lido tanto pelo robô quanto pelo recrutador.","para seu currículo ser lido pelo recrutador."],"explanation":"Opa! Se for o caso, assista novamente ao vídeo!","question":"O currículo deve ser adaptado para:"},{"explanation":"As informações devem estar formatadas de forma que tanto o robô quanto o recrutador as encontre.","items":["Tanto o robô quanto o recrutador devem aceitar o seu currículo. Se qualquer um dos dois não aceitar, você já é desqualificado.","Colocando as palavras-chave necessárias em seu currículo, você chamará a atenção tanto do robô de análise de currículos quanto do recrutador, o que lhe dará uma pontuação excelente e a garantia da vaga.","Se, no seu currículo, independente de como você dispôs as informações, estiver o que o robô de análise de currículos procura, ele vai encontrar, pois o sistema realmente funciona.","O recrutador não tem trabalho na seleção de currículos. Quem tem trabalho é o robô, pois ele apenas pega o currículo já selecionado pelo robô.","A pontuação dada pelo robô tem pouco peso na seleção do currículo, visto que quem realmente faz a seleção é o recrutador."],"question":"Marque a alternativa correta"}],"type":"quiz","markdown":null,"modified":1638042834586,"created":1637626557798,"order":4,"title":"Teste seu conhecimento"}]