[{"markdown":"","modified":1662420558497,"questions":[{"question":"Qual é a estrutura de dados \"coringa\", que se aplica a quase todos os problemas?","explanation":"Vimos isso na introdução, logo no começo.","items":["Não existe uma estrutura de dados coringa.","Array","Lista","String",""]},{"question":"Estrutura de dados é:","explanation":"Pense direitinho. Se precisar, revise a introdução deste módulo.","items":["Como organizar e guardar os dados da forma mais eficiente para o computador.","Como organizar e guardar os dados para facilitar a vida do engenheiro de software.","","",""]}],"order":2,"url":"953a6bb4-b10a-44c1-839b-39fb89180e8e","title":"Teste seus conhecimentos","type":"quiz","created":1662420114469},{"order":1,"markdown":"**Neste módulo, você vai aprender o que é estrutura de dados e entender a importância de dominar este assunto para se dar bem nas entrevistas técnicas.**\n\nUm erro comum de má aplicação de estrutura de dados é resolver todos os problemas com arrays. Normalmente, programadores não sabem exatamente onde e quando usar sets ou hash maps. A falta deste domínio  elimina o candidato do processo.\n\nOs candidatos aprovados nas entrevistas são profissionais que conseguem identificar qual estrutura de dados deve ser aplicada em cada contexto. Para competir  em pé de igualdade com candidatos fortes, você precisa aprender o fundamento das estruturas de dados.\n\nEstruturas de dados são formas especializadas de organizar e guardar dados de forma que possam ser realizadas operações nos dados eficientemente. Em outras palavras, como guardar dados na memória.\n\nAs estrutura de dados são criadas de forma a serem o mais eficientes possível em uma ou mais das operações básicas de manipulação de dados (CRUD - “criar/create”, “ler/read”, “atualizar/update” e “deletar/delete”), mas nunca em todos os contextos. Não existe “bala de prata”, ou seja, a que mata todo e qualquer inimigo.\n","type":"text","title":"O que você vai aprender","modified":1662420094286,"created":1662420094286,"url":"be738db6-fa3f-4a9c-9771-b4c25079d233"}]