[{"markdown":"**Neste módulo você vai aprender o que são pilhas e como aplicá-las durante sua entrevista técnica.**\n\nAssim como *array*, *linkedlist*, *árvore* e *grafo*, pilha é uma estrutura de dados, ou seja, armazena um conjunto de elementos, que possui características particulares e auxiliam o programador a resolver diversos tipos de problemas de entrevistas técnicas com mais eficiência. \nPortanto, é de suma importância que se conheça a fundo essa estrutura de dados.<br/>\n\nÉ bastante comum a usabilidade desse tipo de estrutura de dados em alguns cenários distintos: \n- Quando é utilizada como estrutura principal para resolver problemas;\n- Quando é utilizada como estrutura auxiliar para alguns algoritmos de busca em árvores e grafos.\n\n<hr/>\n\n**Definição** <br/>\nUma pilha é uma estrutura de dados linear do tipo LIFO  *(Last In First Out)*, onde um novo elemento é adicionado no topo e, também, só pode ser removido do topo. Como o próprio nome já diz, podemos associar essa estrutura a uma pilha de livros ou uma pilha de pratos, onde um novo elemento só pode ser adicionado no topo da pilha e o primeiro elemento a ser retirado é o último que foi colocado. <br/>\n\n**Entendendo melhor o conceito *LIFO***:  Em uma pilha de pratos, é possível acrescentar um novo prato ou retirar o prato de cima da pilha. Para retirar o prato debaixo, é necessário remover todos os que estão em cima dele.\n\nUma aplicação que utiliza essa estrutura é o botão de “voltar” do browser. Suponha que ao entrar no browser você visitou, em uma única aba, os seguintes sites: *techjobnoexteriror.com.br*, em seguida, *linkedin.com* e por fim *gmail.com*. Agora tente visualizar os sites sendo alocados no formato de uma pilha. Para chegar ao *techjobnoexteriror.com.br* novamente é necessário voltar pelo *gmail.com*,  *linkedin.com* e só então chegar até o primeiro site acessado.\n\n![Stack Data Structure](https://drive.google.com/uc?export=view&id=1IF9eo8o7w9h5iipNFRLrUpsrvV6xwgKA)\n\n\n\n","created":1665189697104,"order":1,"title":"O que você vai aprender","modified":1667267576157,"url":"c1cae5cd-685a-42e2-8bdd-de37eed4d63b","type":"text"},{"type":"quiz","url":"d0a3ea66-34b2-4dc6-9190-334267775ebe","modified":1665613984079,"order":2,"questions":[{"question":"Sobre Pilhas é correto afirmar que","items":["É uma estrutura de dados que pode resolver problemas específicos ou servir como estrutura de dados auxiliar ","É uma estrutura de dados não linear que pode ser substituída por array","Não se pode classificar como uma estrutura de dados pois segue o padrão LIFO","É uma estrutura que tem pouca usabilidade e não se aplica para entrevistas técnicas",""],"explanation":"Não é bem assim, relembre da usabilidade dessa estrutura de dados."},{"explanation":"Lembre-se do conceito **LIFO - Last In First Out**","items":["O primeiro elemento a entrar será o último a sair","O primeiro elemento a entrar será o primeiro a sair","O último elemento que entrar será o último a sair","",""],"question":"Sobre as regras para inserção e deleção em uma Pilha, é possível afirmar que:"}],"created":1665613831545,"markdown":null,"title":"Teste seus conhecimentos"}]